# Курс "Python для анализа данных"

---
#4.1.1 Работа с объектами Series, DataFrame. Переиндексация, доступ по индексу, выборка, фильтрация

## Где мы сейчас?

<html>
 <head>
  <meta charset="utf-8">
 </head>
 <body>
  <ul>
    <li>1. Введение в анализ данных и разработку на языке Python </li> <!-2.1->
    <li>2. Основы языка </li> <!-2.1->
    <li>3. Библиотеки NumPy и SciPy для решения задач анализа данных и машинного обучения </li> <!-2.1->
    <li>4. <strong>Библиотека Pandas для работы с высокоуровневыми структурами данных</strong> <i><- Вот в этой главе!</i>
     <ul>
      <li><strong>4.1 Введение в структуры данных Pandas</strong> <i><- Вот в этом параграфе!</i></li>
       <ul>
        <li><strong>4.1.1 Работа с объектами Series, DataFrame. Переиндексация, доступ по индексу, выборка, фильтрация</strong><i> <- Вот в этом пункте!</i></li>
        <li>4.1.2 Применение функций и отображений. Арифметические операции и выравнивание данных</li>
        <li>4.1.3 Редукция и вычисление описательных статистик. Обработка отсутствующих данных</li>
        <li>4.1.4 Иерархическое индексирование</li>
       </ul>
      <li>4.2 Переформатирование данных: очистка, преобразование, слияние, изменение формы</li>
     </ul>
    </li>   
  </ul>
 </body>
</html>

## О чем будем говорить?

О высокоуровневых структурах данных  ```Series```  и ```Dataframe```, а также о средствах манипуляции с ними.

## Ключевые слова, понятия и выражения

*   ```pandas```
*   ```Series```
*   ```DataFrame```

## Материал

### Series

```Series``` -  одномерный похожий на массив объект, содержащий массив данных (любого типа, поддерживаемого ```NumPy```) и ассоциированный с ним массив меток, который называется индексом.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
print('Создание объекта Series:')
obj = pd.Series([4, 7, -5, 3])
obj

Создание объекта Series:

0    4
1    7
2   -5
3    3
dtype: int64

In [ ]:
print('Получение значений в виде ndarray массива:')
obj.values

Получение значений в виде ndarray массива:

array([ 4,  7, -5,  3])

In [ ]:
print('Просмотр индекса:')
print(obj.index)

Просмотр индекса:
RangeIndex(start=0, stop=4, step=1)

In [ ]:
print('Создание объекта Series с указанием индексов:')
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
print(obj2)
print(obj2.index)

Создание объекта Series с указанием индексов:
d    4
b    7
a   -5
c    3
dtype: int64
Index(['d', 'b', 'a', 'c'], dtype='object')

In [ ]:
print('Доступ к значению:')
print(obj2['a'])
obj2['d'] = 6
print(obj2[['c', 'a', 'd']])

Доступ к значению:
-5
c    3
a   -5
d    6
dtype: int64

In [ ]:
print('Сохранение связи между индексом и значением после операций:')
print(obj2[obj2 > 0])
print(obj2 * 2)
print(np.exp(obj2))

Сохранение связи между индексом и значением после операций:
d    6
b    7
c    3
dtype: int64
d    12
b    14
a   -10
c     6
dtype: int64
d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [ ]:
print('Проверка наличия индекса:')

print('b' in obj2)

print('e' in obj2)

Проверка наличия индекса:
True
False

In [ ]:
print('Создание объекта Series из словаря:')

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Создание объекта Series из словаря:

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [ ]:
print('Создание объекта Series из словаря с заданными значениями индексов:')
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

Создание объекта Series из словаря с заданными значениями индексов:

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [ ]:
print('Поиск пропусков в данных:')
print(pd.isnull(obj4))
print(pd.notnull(obj4))

Поиск пропусков в данных:
California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [ ]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [ ]:
print('Автоматическое выравнивание данных при операциях над объектами:')
print(obj3)
print(obj4)
print(obj3 + obj4)

Автоматическое выравнивание данных при операциях над объектами:
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [ ]:
print('Название объекта и индексов:')
obj4.name = 'population'
obj4.index.name = 'state'
obj4

Название объекта и индексов:

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [ ]:
print('Смена индексов:')
print(obj)
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
print(obj)

Смена индексов:
0    4
1    7
2   -5
3    3
dtype: int64
Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

```DataFrame``` - табличная структура данных, состоящая из
упорядоченной коллекции столбцов, причем типы значений (числовой, строко­вый, булев и т. д.) в разных столбцах могут различаться. В объекте ```DataFrame``` хранятся два индекса: по строкам и по столбцам. Можно считать, что это словарь 
объектов ```Series```.

In [ ]:
print('Создание объкта DataFrame из словаря:')
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

Создание объкта DataFrame из словаря:

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
frame.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [ ]:
print('Переупорядочивание колонок:')
pd.DataFrame(data, columns=['year', 'state', 'pop'])

Переупорядочивание колонок:

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [ ]:
print('Создание объкта DataFrame из словаря с заданными значениями колонок и индексоов:')
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2

Создание объкта DataFrame из словаря с заданными значениями колонок и индексоов:

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [ ]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [ ]:
print('Получение значений в столбце с использованием двух подходов:')
print(frame2['state'])
print(frame2.year)

Получение значений в столбце с использованием двух подходов:
one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object
one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [ ]:
print('Получение значений в строке:')
frame2.loc['three']

Получение значений в строке:

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [ ]:
print('Пример модифицирования столбца:')
frame2['debt'] = 16.5
print(frame2)
frame2['debt'] = np.arange(6.)
print(frame2)

Пример модифицирования столбца:
       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5
       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [ ]:
print('Пример присваивания значениям столбца объекта Series:')
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

Пример присваивания значениям столбца объекта Series:

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [ ]:
print('Создание столбца:')
frame2['eastern'] = frame2.state == 'Ohio'
frame2

Создание столбца:

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [ ]:
print('Удаление столбца:')
del frame2['eastern']
frame2.columns

Удаление столбца:

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [ ]:
print('Создание DataFrame на основе словаря словарей:')
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)
frame3

Создание DataFrame на основе словаря словарей:

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [ ]:
print('Транспонированный вариант:')
frame3.T

Транспонированный вариант:

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [ ]:
print('Явное задание индексов:')
pd.DataFrame(pop, index=[2001, 2002, 2003])

Явное задание индексов:

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [ ]:
print('Получение значений DataFrame в виде массива ndarray:')
print(frame3.values)
print(frame2.values)

Получение значений DataFrame в виде массива ndarray:
[[2.4 1.7]
 [2.9 3.6]
 [nan 1.5]]
[[2000 'Ohio' 1.5 nan]
 [2001 'Ohio' 1.7 -1.2]
 [2002 'Ohio' 3.6 nan]
 [2001 'Nevada' 2.4 -1.5]
 [2002 'Nevada' 2.9 -1.7]
 [2003 'Nevada' 3.2 nan]]

### Переиндексация

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [ ]:
print('Переиндексация без восполнения:')
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

Переиндексация без восполнения:

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [ ]:
print('Переиндексация с восполнением:')

obj.reindex(['a', 'b', 'c', 'd', 'e'],fill_value = 0)

Переиндексация с восполнением:

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [ ]:
print('Переиндексация с прямым восполнением:')

obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
print(obj3)
print(obj3.reindex(range(6), method='ffill'))

Переиндексация с прямым восполнением:
0      blue
2    purple
4    yellow
dtype: object
0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [ ]:
print('Переиндексация DataFrame:')
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
print(frame)

Переиндексация DataFrame:
   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [ ]:
print('Переиндексация DataFrame:')
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
print(frame2)

Переиндексация DataFrame:
   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

### Доступ по индексу, выборка и фильтрация

#### Удаление вдоль осей

In [ ]:
print('Удаление значений вдоль оси:')
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

Удаление значений вдоль оси:

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [ ]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [ ]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [ ]:
print('Удаление значений вдоль оси в DataFrame:')
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
print(data)

Удаление значений вдоль оси в DataFrame:
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [ ]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [ ]:
print('Удаление и сохранение:')
obj.drop('c', inplace=True)
obj

Удаление и сохранение:

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

#### Индексация

In [ ]:
print('Примеры индексации:')
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

Примеры индексации:

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [ ]:
obj['b']

1.0

In [ ]:
obj[1]

1.0

In [ ]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [ ]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [ ]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [ ]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [ ]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [ ]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [ ]:
print('Индексация DataFrame:')
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

Индексация DataFrame:

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [ ]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [ ]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [ ]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [ ]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [ ]:
print(data.iloc[2, [3, 0, 1]])
print(data.iloc[2])
print(data.iloc[[1, 2], [3, 0, 1]])

four    11
one      8
two      9
Name: Utah, dtype: int64
one       8
two       9
three    10
four     11
Name: Utah, dtype: int64
          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [ ]:
print(data.loc[:'Utah', 'two'])
print(data.iloc[:, :3][data.three > 5])

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64
          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## Дополнительные материалы и литература



*   Уэс Маккинли, Python и анализ данных/ Пер. с англ. Слинкин А. А. - М.: ДМК Пресс, 2015. - 482 с.: ил. С. 127